TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/va-x/drv/drvwifi/drvwifi.c
/*
 * VA-X Wifiドライバ (SX-ULPGN)
 *
 * Copyright (C) 2018 Bionics co.,ltd.
 *
 * 変更:
 * - 2018/03/22 Takuya Goto <goto-takuya@bionics-k.co.jp>: 新規作成
 */

#include "drvwifi.h"

#include <string.h>

#include <kernel.h>
#include <sil.h>
#include <t_syslog.h>
#include <t_stdlib.h>
#include "kernel_cfg.h"
#include "stm32f7xx.h"

#include "drvcmn_gpio.h"
#include "drvcmn_uart.h"

/*
 * マクロ定義
 */

// デバッグログ
#if 0
#define DBGLOG0(msg)					syslog(LOG_NOTICE, "[DRVWIFI]" msg)
#define DBGLOG1(msg, arg1)				syslog(LOG_NOTICE, "[DRVWIFI]" msg, arg1)
#define DBGLOG2(msg, arg1, arg2)		syslog(LOG_NOTICE, "[DRVWIFI]" msg, arg1, arg2)
#define DBGLOG3(msg, arg1, arg2, arg3)	syslog(LOG_NOTICE, "[DRVWIFI]" msg, arg1, arg2, arg3)
#else
#define DBGLOG0(msg)
#define DBGLOG1(msg, arg1)
#define DBGLOG2(msg, arg1, arg2)
#define DBGLOG3(msg, arg1, arg2, arg3)
#endif

// サービスコールのエラーのログ出力
static inline void svc_perror(const char *file, int_t line, const char *expr, ER ercd)
{
	if (ercd < 0) {
		t_perror(LOG_ERROR, file, line, expr, ercd);
	}
}
#define	SVC_PERROR(expr)	svc_perror(__FILE__, __LINE__, #expr, (expr))

/*
 * 型定義
 */

// メモリプールブロック
typedef struct {
    uint32_t msg;
    DRVWIFI_CALLBACK_T callback;
    intptr_t data;
    size_t size;
} DRVWIFI_MPFBLK_T;

// DRVWIFI_MPFBLK_SIZE は sizeof(DRVWIFI_MPFBKL) に一致させること
static_assert(sizeof(DRVWIFI_MPFBLK_T) == DRVWIFI_MPFBLK_SIZE, "MPF size");


/*
 * 内部関数プロトタイプ
 */
// メモリプールブロックを使ってメッセージ送信
static void mpf_send(int msg, DRVWIFI_CALLBACK_T callback, intptr_t data, size_t size);

// wifiモジュール初期化
static void process_msg_initialize(DRVWIFI_CALLBACK_T callback);
// wifiモジュール電源Off
static void process_msg_power_off(DRVWIFI_CALLBACK_T callback);
// APに接続
static void process_msg_ap_connect(DRVWIFI_CALLBACK_T callback, DRVWIFI_CONFIG* cfg);
// WPSでAPに接続
static void process_msg_ap_connect_wps(DRVWIFI_CALLBACK_T callback);
// AP切断
static void process_msg_ap_disconnect(DRVWIFI_CALLBACK_T callback);
// HTTPS 接続
static void process_msg_https_connect(DRVWIFI_CALLBACK_T callback, DRVWIFI_HTTPS_CONFIG* httpcfg);
// HTTPS POST
static void process_msg_https_post(DRVWIFI_CALLBACK_T callback, DRVWIFI_HTTPS_REQ* hreq);
// HTTPS 切断
static void process_msg_https_disconnect(DRVWIFI_CALLBACK_T callback);
// PING送信
static void process_msg_ping(DRVWIFI_CALLBACK_T callback, DRVWIFI_PING* ping);

// UART送信
static int uart_send_at(const uint8_t* data, size_t data_len, bool_t discard_echo);

// UART受信
static int uart_receive(uint8_t* data, size_t data_len);

// UART1行受信(\r\nまで読み込み)
static int uart_receive_1line(uint8_t* data, size_t data_limit);

// UART ISRコールバック
static bool_t uart_isr_callback(int type, uint32_t opt);

/*
 * 定数定義
 */

// GPIO(UART)
static const DRVCMN_GPIO_PIN_T GPIO_PINS_UART[] = {
    { DRVCMN_GPIO_PORT_E, 7 },	// AF8: UART7_RX
    { DRVCMN_GPIO_PORT_E, 8 },	// AF8: UART7_TX
    { DRVCMN_GPIO_PORT_E, 9 },	// AF8: UART7_RTS
    { DRVCMN_GPIO_PORT_E, 10 },	// AF8: UART7_CTS
};

// GPIO設定(UART)
static const DRVCMN_GPIO_SETTING_T GPIO_SETTING_UART = {
    .mode = DRVCMN_GPIO_MODE_AF,
    .otype = DRVCMN_GPIO_OTYPE_PP,
    .ospeed = DRVCMN_GPIO_OSPEED_HIGH,
    .pupd = DRVCMN_GPIO_PUPD_PULLUP,
    .afno = 8,
};

// UART設定
static const int WIFI_UART = 7;	// UART7
static const DRVCMN_UART_SETTING_T UART_SETTING = {
    .clocksel = DRVCMN_UART_CLOCKSEL_SYS,
    .baudrate = 115200,
    .wordlen = DRVCMN_UART_WORD_8BIT,
    .parity = DRVCMN_UART_PARITY_NONE,
    .stop = DRVCMN_UART_STOP_1,
    .hwflow = true,
    .callback = uart_isr_callback,
};

// WIFI_ON
static const DRVCMN_GPIO_PIN_T GPIO_PIN_WIFI_ON = { DRVCMN_GPIO_PORT_D, 10 };	// PD10: WIFI_ON (Active Low)

// GPIO設定(CARD_ON)
static const DRVCMN_GPIO_SETTING_T GPIO_SETTING_WIFI_ON = {
    .mode = DRVCMN_GPIO_MODE_GPOUT,
    .otype = DRVCMN_GPIO_OTYPE_PP,
    .ospeed = DRVCMN_GPIO_OSPEED_HIGH,
    .pupd = DRVCMN_GPIO_PUPD_PULLUP,
    .afno = 0,
};

// メッセージ番号
enum {
    MSG_INITIALIZE = 1,
    MSG_POWER_OFF,
    MSG_AP_CONNECT,
    MSG_AP_CONNECT_WPS,
    MSG_AP_DISCONNECT,
    MSG_HTTP_CONNECT,
    MSG_HTTP_POST,
    MSG_HTTP_DISCONNECT,
	MSG_PING,
};


// イベントフラグ
static const FLGPTN FLGPTN_UART_TXCOMPLETE = (0x1 << 0);
static const FLGPTN FLGPTN_UART_RXCOMPLETE = (0x1 << 1);

// タイムアウト
static const int32_t SYSCALL_TIMEOUT = 1000;
//static const int32_t UART_TIMEOUT = 3000;
static const int32_t UART_TIMEOUT = 20000;

// ATコマンド 結果コード
#define CR							"\r"		// CR
#define CRLF						"\r\n"	    // CRLF
#define ATRET_OK					"OK"
#define ATRET_CONNECT		        "CONNECT"
#define ATRET_RING				    "RING"
#define ATRET_NOCARRIER	            "NO CARRIER"
#define ATRET_ERROR			        "ERROR"
#define ATRET_NODIALTONE	        "NO DIALTONE"
#define ATRET_BUSY				    "BUSY"
#define ATRET_NOANSWER	            "NO ANSWER"

// ATコマンド
#define ATCMD_RESET					"ATZ"			// ソフトウェアリセット
#define ATCMD_ECHO_OFF				"ATE0"			// コマンドエコーOFF
#define ATCMD_ECHO_ON				"ATE1"			// コマンドエコーON
#define ATCMD_APCONNECT			    "ATWAWPA"		// APへの接続
#define ATCMD_APCONNECT_WPS	        "ATWAWPS"		// APへの接続(WPS)
#define ATCMD_APDISCONNECT		    "ATWD"			// 無線切断
#define ATCMD_HTTPS_TLSINIT		    "ATNHTTPCSSL"	// TSLコンテキスト初期化
#define ATCMD_HTTPS_CONN			"ATNHTTPCCON"	// HTTP接続
#define ATCMD_HTTPS_EXHDR		    "ATNHTTPCHDR"	// 拡張HTTPヘッダ設定
#define ATCMD_HTTPS_BODY			"ATNHTTPCBODY"	// HTTP本文設定
#define ATCMD_HTTPS_POST			"ATNHTTPCPOST"	// HTTP送信
#define ATCMD_HTTPS_DISCONN	        "ATNHTTPCDISC"	// HTTP切断
#define ATCMD_PING				        "ATNPING"				// Debug用pingコマンド
#define AT_ESC_SEQUENCE			    "+++"			// 透過モードOffエスケープシーケンス


// バッファサイズ
#define RECEIVE_BUF_SIZE	(1024)
#define RECEIVE_POST_SIZE	(2048)

/*
 * 内部変数
 */
// コンテキスト情報
static struct {
    uint8_t receive_buf[RECEIVE_BUF_SIZE];
    uint8_t receive_post[RECEIVE_POST_SIZE];
} s_context;


/*********************************************************************
 * 公開関数
 ********************************************************************/

/*
 * ペリフェラル初期化
 */
void drvwifi_peripheral_initialize(void)
{
    // GPIO初期化(UART)
    for (int i = 0; i < sizeof(GPIO_PINS_UART) / sizeof(GPIO_PINS_UART[0]); i++) {
        drvcmn_gpio_pin_initialize(&(GPIO_PINS_UART[i]), &GPIO_SETTING_UART);
    }

    drvcmn_gpio_pin_initialize(&GPIO_PIN_WIFI_ON, &GPIO_SETTING_WIFI_ON);
    drvcmn_gpio_pin_set(&GPIO_PIN_WIFI_ON, true);  //Power Off
}

