TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/va-x/drv/drvwifi/drvwifi.c
/*
 * ドライバ初期化
 */
void drvwifi_initialize(DRVWIFI_CALLBACK_T callback)
{
    ER er = 0;

    // ドライバタスク起動
    er = act_tsk(TSK_DRVWIFI);
    assert(er == E_OK);

    // 起動直後はWiFiモジュールをONしない。サーバアクセス時のみ起動する
    // 初期化メッセージを送信
    // mpf_send(MSG_INITIALIZE, callback, 0, 0);
}

/*
 * wifiモジュールのリセット
 */
void drvwifi_start(DRVWIFI_CALLBACK_T callback)
{
	// メッセージを送信
    mpf_send(MSG_INITIALIZE, callback, 0, 0);	
}

/*
 * wifiモジュール電源Off
 */
void drvwifi_power_off(DRVWIFI_CALLBACK_T callback)
{
    // 終了メッセージを送信
    mpf_send(MSG_POWER_OFF, callback, 0, 0);	
}

/* 
 *APに接続
 */
void drvwifi_ap_connect(DRVWIFI_CALLBACK_T callback, DRVWIFI_CONFIG* ap)
{
	// メッセージを送信
    mpf_send(MSG_AP_CONNECT, callback, (intptr_t)ap, 0);	
}

/*
 * WPSでAPに接続
 */
void drvwifi_ap_connect_wps(DRVWIFI_CALLBACK_T callback)
{
	// メッセージを送信
    mpf_send(MSG_AP_CONNECT_WPS, callback, 0, 0);	
}

/* 
 *AP切断
 */
void drvwifi_ap_disconnect(DRVWIFI_CALLBACK_T callback)
{
	// メッセージを送信
    mpf_send(MSG_AP_DISCONNECT, callback, 0, 0);	
}

/*
 * HTTPS 接続
 */
void drvwifi_https_connect(DRVWIFI_CALLBACK_T callback, DRVWIFI_HTTPS_CONFIG* httpcfg)
{
	// メッセージを送信
    mpf_send(MSG_HTTP_CONNECT, callback, (intptr_t)httpcfg, 0);	
}

/*
 * HTTPS POST
 */
void drvwifi_https_post(DRVWIFI_CALLBACK_T callback, DRVWIFI_HTTPS_REQ* req)
{
	// メッセージを送信
    mpf_send(MSG_HTTP_POST, callback, (intptr_t)req, 0);	
}

/*
 * HTTPS 切断
 */
void drvwifi_https_disconnect(DRVWIFI_CALLBACK_T callback)
{
	// メッセージを送信
    mpf_send(MSG_HTTP_DISCONNECT, callback, 0, 0);	
}

/* 
 * PING
 */
void drvwifi_ping(DRVWIFI_CALLBACK_T callback, DRVWIFI_PING* ping)
{
	// メッセージを送信
    mpf_send(MSG_PING, callback, (intptr_t)ping, 0);	
}


/*
 * タスク
 */
void drvwifi_task(intptr_t exinf)
{
    DBGLOG0("drvwifi_task() starts .");

    while (true) {
        DRVWIFI_MPFBLK_T* blk = NULL;
        ER er = 0;
        er = trcv_dtq(DTQ_DRVWIFI, (intptr_t*)&blk, TMO_FEVR);
        assert(er == E_OK);
        switch (blk->msg) {
        case MSG_INITIALIZE:
        {
            process_msg_initialize(blk->callback);
            break;
        }
        case MSG_POWER_OFF:
        {
            process_msg_power_off(blk->callback);
            break;
        }
		case MSG_AP_CONNECT:
        {
            process_msg_ap_connect(blk->callback, (DRVWIFI_CONFIG*)blk->data);
            break;
        }
		case MSG_AP_CONNECT_WPS:
        {
            process_msg_ap_connect_wps(blk->callback);
            break;
        }
		case MSG_AP_DISCONNECT:
        {
            process_msg_ap_disconnect(blk->callback);
            break;
        }
		case MSG_HTTP_CONNECT:
        {
            process_msg_https_connect(blk->callback, (DRVWIFI_HTTPS_CONFIG*)blk->data);
            break;
        }
		case MSG_HTTP_POST:
        {
            process_msg_https_post(blk->callback, (DRVWIFI_HTTPS_REQ*)blk->data);
            break;
        }
		case MSG_HTTP_DISCONNECT:
        {
            process_msg_https_disconnect(blk->callback);
            break;
        }
		case MSG_PING:
        {
            process_msg_ping(blk->callback, (DRVWIFI_PING*)blk->data);
            break;
        }
        default:
            assert(false);
            break;
        }

        er = rel_mpf(MPF_DRVWIFI, blk);
        assert(er == E_OK);
    }
}

/*
 * 受信タスク
 */
void drvwifi_rx_task(intptr_t exinf)
{
    
}

/*********************************************************************
 * 内部関数
 ********************************************************************/

/*
 * メッセージ送信
 */
void mpf_send(int msg, DRVWIFI_CALLBACK_T callback, intptr_t data, size_t size)
{
    DRVWIFI_MPFBLK_T* blk = NULL;
    ER er = 0;
    er = tget_mpf(MPF_DRVWIFI, (void**)&blk, SYSCALL_TIMEOUT);
    assert(er == E_OK);

    blk->msg = msg;
    blk->callback = callback;
    blk->data = data;
    blk->size = size;
    er = tsnd_dtq(DTQ_DRVWIFI, (intptr_t)blk, SYSCALL_TIMEOUT);
    assert(er == E_OK);
}

/*
 * wifiモジュール初期化
 */
void process_msg_initialize(DRVWIFI_CALLBACK_T callback)
{
    assert(callback);
    
	int recvcnt;
    ER er = 0;
    FLGPTN flgptn = 0;

    // WIFIモジュールのリセット(電源OFF->ON)
    drvcmn_gpio_pin_set(&GPIO_PIN_WIFI_ON, true);
    dly_tsk(10); // 10ms待つ
    drvcmn_gpio_pin_set(&GPIO_PIN_WIFI_ON, false);

    // UART初期化
    drvcmn_uart_initialize(WIFI_UART, &UART_SETTING);

    // UART読み捨て
    drvcmn_uart_receive(WIFI_UART, NULL, 1024);
    dly_tsk(100);	// 100ms待つ
    drvcmn_uart_cancel_receive(WIFI_UART);


    // WIFIモジュールに初期化コマンド("ATZ")を送る
    DBGLOG1("SEND: \"%s\"", ATCMD_RESET);
    uart_send_at((const uint8_t*)ATCMD_RESET, sizeof(ATCMD_RESET) - 1, true);
    // 応答受信
	recvcnt = 0;
    for (int i = 0; i < 5; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
  }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';
	
    // コマンドエコーOFF("ATE0")
    DBGLOG1("SEND: \"%s\"", ATCMD_ECHO_OFF);
    uart_send_at((const uint8_t*)ATCMD_ECHO_OFF, sizeof(ATCMD_ECHO_OFF) - 1, true);
    // 応答受信
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
		recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			break;
		}
	}
    DBGLOG1("recvcnt = %d", recvcnt);
	DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

    // コールバック
    callback(DRVWIFI_EVT_INITIALIZE_COMPLETE, 0, 0);
}

/*
 *  wifiモジュール電源Off
 */
void process_msg_power_off(DRVWIFI_CALLBACK_T callback)
{
    assert(callback);
	
	// CARD_OFF
    drvcmn_gpio_pin_set(&GPIO_PIN_WIFI_ON, false);	// WIFI_ON => L (ON)
    dly_tsk(10);
    drvcmn_gpio_pin_set(&GPIO_PIN_WIFI_ON, true);	// WIFI_ON => H (OFF)
    DBGLOG1("GPIO: \"%s\"", "WIFI OFF");
	
	// コールバック
    callback(DRVWIFI_EVT_POWER_OFF_COMPLETE, 0, 0);
}

/*
 *  APに接続
 */
void process_msg_ap_connect(DRVWIFI_CALLBACK_T callback, DRVWIFI_CONFIG* cfg)
{
    assert(callback);
    assert(cfg);

	char	buf[sizeof(ATCMD_APCONNECT)+16+DRVWIFI_MAX_PASSPHRASE_LEN];
	int		cnt, recvcnt;
    ER er = 0;
    FLGPTN flgptn = 0;
	int32_t	ret=0;


    // WIFIモジュールに接続コマンドを送る
	cnt = sizeof(ATCMD_APCONNECT)-1;
	memcpy(buf, ATCMD_APCONNECT, cnt);									//コマンド文字
	buf[cnt] = '=';
	cnt += 1;
	memcpy(&(buf[cnt]), cfg->essid, cfg->essid_len);						//SSID
	cnt += cfg->essid_len;
	if(cfg->wpaver == DRVWIFI_SECURITY_WPA) {
		memcpy(&(buf[cnt]), ",1", 2);										//WPA ver
		cnt += 2;
	} else {
		memcpy(&(buf[cnt]), ",2", 2);										//WPA ver
		cnt += 2;
	}
	if(cfg->cipher == DRVWIFI_SECURITY_TKIP) {
		memcpy(&(buf[cnt]), ",TKIP,TKIP,", 11);								//暗号指定
		cnt += 11;
	} else {
		memcpy(&(buf[cnt]), ",CCMP,CCMP,", 11);							//暗号指定
		cnt += 11;
	}
	memcpy(&(buf[cnt]), cfg->passphrase, cfg->passphrase_len);		    //パスワード
	cnt += cfg->passphrase_len;
	buf[cnt] = '\0';

	// コマンド発行
    DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
    uart_send_at((const uint8_t*)buf, cnt, false);
	
    // 応答2行受信
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
    }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

