TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/va-x/drv/drvwifi/drvwifi.c
	// コールバック
    callback(DRVWIFI_EVT_AP_CONNECT_COMPLETE, ret, 0);
}

/*
 * WPSでAPに接続
 */
void process_msg_ap_connect_wps(DRVWIFI_CALLBACK_T callback)
{
    assert(callback);

	char	buf[sizeof(ATCMD_APCONNECT_WPS)+8];
	int		cnt, recvcnt;
    ER er = 0;
    FLGPTN flgptn = 0;
	int32_t	ret=0;

    // WIFIモジュールに接続コマンドを送る
	cnt = sizeof(ATCMD_APCONNECT_WPS)-1;
	memcpy(buf, ATCMD_APCONNECT_WPS, cnt);				//コマンド文字
	buf[cnt] = '=';
	cnt += 1;
	memcpy(&buf[cnt], "1,PUSH", 6);								//パラメタ
	cnt += 6;
	buf[cnt] = '\0';

	// コマンド発行
	DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
	uart_send_at((const uint8_t*)buf, cnt, false);
	
    // 応答2行受信
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
		break;
		} else {
			ret = (int32_t)-1;
		}
    }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

	// コールバック
    callback(DRVWIFI_EVT_AP_CONNECT_WPS_COMPLETE, ret, 0);
}

/*
 * AP切断
 */
void process_msg_ap_disconnect(DRVWIFI_CALLBACK_T callback)
{
    assert(callback);
	
	int recvcnt;
    ER er = 0;
    FLGPTN flgptn = 0;
	int32_t	ret=0;

	// 切断コマンドを送る
    DBGLOG1("SEND: \"%s\"", ATCMD_APDISCONNECT);
    uart_send_at((const uint8_t*)ATCMD_APDISCONNECT, sizeof(ATCMD_APDISCONNECT) - 1, false);	
	
    // 応答2行受信
	recvcnt = 0;
    for (int i = 0; i <2; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
    }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

	// コールバック
    callback(DRVWIFI_EVT_AP_DISCONNECTED, ret, 0);
}


/*
 * HTTPS 接続
 */
void process_msg_https_connect(DRVWIFI_CALLBACK_T callback, DRVWIFI_HTTPS_CONFIG* httpcfg)
{
    assert(callback);
    assert(httpcfg);
	
	char	buf[128];
	int		cnt, recvcnt;
    ER er = 0;
    FLGPTN flgptn = 0;
	int32_t	ret=0;

    /* TLSコンテキスト初期化 */
	cnt = sizeof(ATCMD_HTTPS_TLSINIT)-1;
	memcpy(buf, ATCMD_HTTPS_TLSINIT, cnt);			//コマンド文字
	memcpy(&buf[cnt], "=1", 2);								//パラメタ
	cnt += 2;
	buf[cnt] = '\0';
	// コマンド発行
    //dly_tsk(1000);
	DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
    uart_send_at((const uint8_t*)buf, cnt, false);
    // 応答2行受信
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
    }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

	
	/* HTTPSクライアント接続 */
	cnt = sizeof(ATCMD_HTTPS_CONN)-1;
	memcpy(buf, ATCMD_HTTPS_CONN, cnt);			//コマンド文字
	buf[cnt] = '=';
	cnt += 1;
	if(httpcfg->schema == DRVWIFI_SCHEMA_HTTPS) {
		memcpy(&buf[cnt], "https://", 8);				//https指定
		cnt += 8;
	}
	memcpy(&buf[cnt], httpcfg->hostname, httpcfg->hostname_len);			//パラメタ：ホスト名
	cnt += httpcfg->hostname_len;
	buf[cnt] = '\0';
	// コマンド発行
	DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
    uart_send_at((const uint8_t*)buf, cnt, false);
    // 応答2行受信
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
 		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
   }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

	
	/* 拡張HTTPSヘッダー設定 */
	if((httpcfg->exhdrname_len != 0) || (httpcfg->exhdrval_len != 0)) {
		cnt = sizeof(ATCMD_HTTPS_EXHDR)-1;
		memcpy(buf, ATCMD_HTTPS_EXHDR, cnt);			//コマンド文字
		memcpy(&buf[cnt], "=", 1);
		cnt += 1;
		memcpy(&buf[cnt], httpcfg->exhdrname, httpcfg->exhdrname_len);		//拡張ヘッダname
		cnt += httpcfg->exhdrname_len;
		memcpy(&buf[cnt], ":", 1);
		cnt += 1;
		memcpy(&buf[cnt], httpcfg->exhdrvalue, httpcfg->exhdrval_len);		//拡張ヘッダvalue
		cnt += httpcfg->exhdrval_len;
		buf[cnt] = '\0';
		// コマンド発行
		DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
		uart_send_at((const uint8_t*)buf, cnt, false);
		// 応答2行受信
		recvcnt = 0;
		for (int i = 0; i < 2; i++) {
			recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
			if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
				ret = (int32_t)0;
				break;
			} else {
				ret = (int32_t)-1;
			}
		}
		DBGLOG1("recvcnt = %d", recvcnt);
		DBGLOG1("result: \"%s\"", s_context.receive_buf);
		s_context.receive_buf[0]='\0';
	}

	
	// コールバック
    callback(DRVWIFI_EVT_HTTP_CONNECT_COMPLETE, ret, 0);
}

/*
 * HTTPS POST
 */
void process_msg_https_post(DRVWIFI_CALLBACK_T callback, DRVWIFI_HTTPS_REQ* hreq)
{
    assert(callback);
    assert(hreq);

	char	buf[DRVWIFI_MAX_BODY_LEN+sizeof(ATCMD_HTTPS_BODY)+1];
	int		cnt, recvsz, recvcnt;
	int32_t	ret=0;
    ER er = 0;
    FLGPTN flgptn = 0;

    /* 本文設定 */
	if(hreq->body_len != 0) {
		cnt = sizeof(ATCMD_HTTPS_BODY)-1;
		memcpy(buf, ATCMD_HTTPS_BODY, cnt);			//コマンド文字
		memcpy(&buf[cnt], "=", 1);
		cnt += 1;
		memcpy(&buf[cnt], hreq->body, hreq->body_len);	//パラメタ：本文
		cnt += hreq->body_len;
		buf[cnt] = '\0';
		// コマンド発行
		DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
		uart_send_at((const uint8_t*)buf, cnt, false);
		//結果コード取得
		recvcnt = 0;
		for (int i = 0; i < 2; i++) {
			recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
			if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
				//OKなら1行受信のため、抜ける
				ret = (int32_t)0;
				break;
			} else {
				ret = (int32_t)-1;
			}
		}
		DBGLOG1("recvcnt = %d", recvcnt);
		DBGLOG1("result: \"%s\"", s_context.receive_buf);
		s_context.receive_buf[0]='\0';
	}
	
	/* HTTPS POST送信 */
	cnt = sizeof(ATCMD_HTTPS_POST)-1;
	memcpy(buf, ATCMD_HTTPS_POST, cnt);			//コマンド文字
	memcpy(&buf[cnt], "=", 1);
	cnt += 1;
	memcpy(&buf[cnt], hreq->path, hreq->path_len);	//パラメタ：パス
	cnt += hreq->path_len;
	buf[cnt] = '\0';
	// コマンド発行
	DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
    uart_send_at((const uint8_t*)buf, cnt, false);
	// 応答受信

//SilexのUART仕様と実際が異なり、コンテンツの長さが応答パラメタにないため、以下のコードをコメントアウト
	//まず2行取得し、受信サイズを獲得
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
		recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
	}
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("recv 1line: \"%s\"", s_context.receive_buf);
	for(int i=0; i<RECEIVE_BUF_SIZE; i++) {
		//カンマの次から改行までが受信サイズ
		if(s_context.receive_buf[i] == ',') {
			recvsz = atoi(&(s_context.receive_buf[i+1]));
			break;
		}
	}
	DBGLOG1("recvsz = %d", recvsz);
	//応答コンテンツ取得
	s_context.receive_post[0] = '\0';
    if(recvsz > RECEIVE_POST_SIZE) {
        recvsz = RECEIVE_POST_SIZE;
    }
	if(recvsz > 0)	{
		uart_receive(s_context.receive_post, recvsz);
		DBGLOG1("recv left: \"%s\"", s_context.receive_post);
	}
	recvcnt = 0;
    for (int i = 0; i < 2; i++) {
		recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
	}
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

