TaLucGiaHoang/AQUBIO_Android_STM32/STM32/BASE_20181204/va-x/va-x/drv/drvwifi/drvwifi.c
	// コールバック
    callback(DRVWIFI_EVT_HTTP_POST_COMPLETE, ret, (intptr_t)s_context.receive_post);
}

/*
 * HTTPS 切断
 */
void process_msg_https_disconnect(DRVWIFI_CALLBACK_T callback)
{
    assert(callback);
	
	int recvcnt;
    ER er = 0;
    FLGPTN flgptn = 0;
	int32_t	ret=0;

	// 切断コマンドを送る
    DBGLOG1("SEND: \"%s\"", ATCMD_HTTPS_DISCONN);
    uart_send_at((const uint8_t*)ATCMD_HTTPS_DISCONN, sizeof(ATCMD_HTTPS_DISCONN) - 1, false);	
	
    // 応答2行受信
	recvcnt = 0;
    for (int i = 0; i <2; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
    }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

	// コールバック
    callback(DRVWIFI_EVT_HTTP_DISCONNECT_COMPLETE, ret, 0);
}

/*
 * PING
 */
void process_msg_ping(DRVWIFI_CALLBACK_T callback, DRVWIFI_PING* ping)
{
    assert(callback);

	char	buf[DRVWIFI_MAX_IPADR_LEN+sizeof(ATCMD_PING)+1];
	int		cnt, recvcnt;
	int32_t	ret=0;
    ER er = 0;
    FLGPTN flgptn = 0;
	
	/* PING送信 */
	cnt = sizeof(ATCMD_PING)-1;
	memcpy(buf, ATCMD_PING, cnt);			//コマンド文字
	memcpy(&buf[cnt], "=", 1);
	cnt += 1;
	memcpy(&buf[cnt], ping->ip_address, ping->ipadr_len);	//パラメタ：ip adr
	cnt += ping->ipadr_len;
	buf[cnt] = '\0';
	// コマンド発行
	DBGLOG2("SEND: \"%s\"  >num=%d", buf, cnt);
    uart_send_at((const uint8_t*)buf, cnt, false);
	
    // 応答受信
	recvcnt = 0;
    for (int i = 0; i <3; i++) {
        recvcnt += uart_receive_1line(s_context.receive_buf, RECEIVE_BUF_SIZE);
		if(strncmp(ATRET_OK, s_context.receive_buf ,sizeof(ATRET_OK)-1) == 0) {
			//OKなら1行受信のため、抜ける
			ret = (int32_t)0;
			break;
		} else {
			ret = (int32_t)-1;
		}
    }
    DBGLOG1("recvcnt = %d", recvcnt);
    DBGLOG1("result: \"%s\"", s_context.receive_buf);
	s_context.receive_buf[0]='\0';

	// コールバック
    callback(DRVWIFI_EVT_PING_COMPLETE, ret, 0);
}


/*
 * UARTでATコマンド送信(CRを付加して送信)
 */
int uart_send_at(const uint8_t* data, size_t data_len, bool_t discard_echo)
{
    assert(data);
    assert(data_len > 0);

    FLGPTN flgptn = 0;
    ER er = 0;
	uint8_t buf[1024];

    // イベントフラグをクリア
    er = clr_flg(FLG_DRVWIFI, ~FLGPTN_UART_TXCOMPLETE);
    assert(er == E_OK);


    // コマンド送信
	memcpy(buf, data, data_len);
	buf[data_len] = '\r'; //CR追加
//	buf[data_len+1] = '\n'; //LF追加
	DBGLOG2("cmd>%s    cmd_num>%d", buf, data_len+1);
    drvcmn_uart_send(WIFI_UART, buf, data_len+1);

    // 送信完了を待つ
    er = twai_flg(FLG_DRVWIFI, FLGPTN_UART_TXCOMPLETE, TWF_ANDW, &flgptn, UART_TIMEOUT);
    assert((er == E_OK) || (er == E_TMOUT));

	// タイムアウトの場合は中断処理
    if (er == E_TMOUT) {
        drvcmn_uart_cancel_send(WIFI_UART);
    }

    if (discard_echo) {
        // コマンドエコー受信(読み捨て)完了を待つ
		uart_receive(NULL, data_len + 1);
    }

    return 0;
}

/*
 * UART受信(サイズ指定)
 */
int uart_receive(uint8_t* data, size_t data_len)
{
    ER er = 0;
    FLGPTN flgptn = 0;

    // イベントフラグをクリア
    er = clr_flg(FLG_DRVWIFI, ~FLGPTN_UART_RXCOMPLETE);
    assert(er == E_OK);

    // 受信
    drvcmn_uart_receive(WIFI_UART, data, data_len);

    // 受信完了を待つ
    er = twai_flg(FLG_DRVWIFI, FLGPTN_UART_RXCOMPLETE, TWF_ANDW, &flgptn, UART_TIMEOUT);
    assert((er == E_OK) || (er == E_TMOUT));

    // タイムアウトの場合は中断処理
    if (er == E_TMOUT) {
        drvcmn_uart_cancel_receive(WIFI_UART);
    }

    return 0;
}

/*
 * UART1行受信(\r\nまで読み込み)
 */
int uart_receive_1line(uint8_t* data, size_t data_limit)
{
    const uint8_t* PATTERN = (const uint8_t*)CRLF;
    const size_t PATTERN_LEN = (sizeof(CRLF)-1);	// 終端文字を除く
    ER er = 0;
    FLGPTN flgptn = 0;

	// イベントフラグをクリア
    er = clr_flg(FLG_DRVWIFI, ~FLGPTN_UART_RXCOMPLETE);
    assert(er == E_OK);
	
    size_t received = 0;
    size_t match_count = 0;
    for (received = 0; received < data_limit; received++) {
        // 1文字受信
        drvcmn_uart_receive(WIFI_UART, &(data[received]), 1);
	
        // 送信完了を待つ(コマンドエコーを読み捨てる場合は受信完了も待つ)
        er = twai_flg(FLG_DRVWIFI, FLGPTN_UART_RXCOMPLETE, TWF_ANDW, &flgptn, UART_TIMEOUT);
        assert((er == E_OK)  || (er == E_TMOUT));
        if (er != E_OK) {
    // タイムアウトの場合は中断処理
			if (er == E_TMOUT) {
				drvcmn_uart_cancel_receive(WIFI_UART);
			}
            break;
        }

        // 比較
//        if ((data[received] == PATTERN[0]) && (data[received+1] == PATTERN[1])) {
//                DBGLOG2("string>%s, recv_num>%d", data, received+1);
//                break;
//		}

		if (data[received] == PATTERN[match_count]) {
            match_count++;
            if (match_count >= PATTERN_LEN) {
//                DBGLOG1("match!(%d)", received+1);
//                DBGLOG2("string>%s    recv_num>%d", data, received+1);
                break;
            }
        } else {
            match_count = 0;
        }
	}

    return received;
}

/*
 * UART ISRコールバック
 */
bool_t uart_isr_callback(int type, uint32_t opt)
{
    ER er = E_OK;
    switch (type) {
    case DRVCMN_UART_TXCOMPLETE:
        er = iset_flg(FLG_DRVWIFI, FLGPTN_UART_TXCOMPLETE);
        assert(er == E_OK);
        break;
    case DRVCMN_UART_RXCOMPLETE:
        er = iset_flg(FLG_DRVWIFI, FLGPTN_UART_RXCOMPLETE);
        assert(er == E_OK);
        break;
    case DRVCMN_UART_ERROR:
        // TODO: [暫定]Framing Error を無視する
        //DBGLOG1("UARTERROR: 0x%08x", opt);
        break;
    default:
        assert(false);
        break;
    }

    return false;
}
